program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "1.13.1+cu117"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 512, 512]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.1c4bep-6)];
            tensor<fp32, [1, 3, 512, 512]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> image__biased___y_0 = const()[name = tensor<string, []>("image__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1.0f177ap+1]], [[-0x1.04924ap+1]], [[-0x1.cdf012p+0]]]])];
            tensor<fp32, [1, 3, 512, 512]> image__biased__ = add(x = image__scaled__, y = image__biased___y_0)[name = tensor<string, []>("image__biased__")];
            tensor<int32, []> var_27 = const()[name = tensor<string, []>("op_27"), val = tensor<int32, []>(1024)];
            tensor<int32, []> var_29 = const()[name = tensor<string, []>("op_29"), val = tensor<int32, []>(640)];
            tensor<int32, []> var_31 = const()[name = tensor<string, []>("op_31"), val = tensor<int32, []>(256)];
            tensor<int32, []> var_40 = const()[name = tensor<string, []>("op_40"), val = tensor<int32, []>(128)];
            tensor<int32, []> var_45 = const()[name = tensor<string, []>("op_45"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_49 = const()[name = tensor<string, []>("op_49"), val = tensor<int32, []>(-1)];
            tensor<int32, [2]> var_112 = const()[name = tensor<string, []>("op_112"), val = tensor<int32, [2]>([4, 4])];
            tensor<int32, [2]> var_114 = const()[name = tensor<string, []>("op_114"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_1_pad_type_1 = const()[name = tensor<string, []>("x_1_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_1_pad_1 = const()[name = tensor<string, []>("x_1_pad_1"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [32, 3, 7, 7]> model_backbone_layers_0_0_projection_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_0_projection_weight_to_fp16"), val = tensor<fp16, [32, 3, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> model_backbone_layers_0_0_projection_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_0_projection_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9536)))];
            tensor<fp16, [1, 3, 512, 512]> cast_234 = cast(dtype = image_to_fp16_dtype_0, x = image__biased__)[name = tensor<string, []>("cast_234")];
            tensor<fp16, [1, 32, 128, 128]> x_1_cast_fp16 = conv(bias = model_backbone_layers_0_0_projection_bias_to_fp16, dilations = var_114, groups = var_45, pad = x_1_pad_1, pad_type = x_1_pad_type_1, strides = var_112, weight = model_backbone_layers_0_0_projection_weight_to_fp16, x = cast_234)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [3]> concat_18 = const()[name = tensor<string, []>("concat_18"), val = tensor<int32, [3]>([1, 32, 16384])];
            tensor<fp16, [1, 32, 16384]> var_121_cast_fp16 = reshape(shape = concat_18, x = x_1_cast_fp16)[name = tensor<string, []>("op_121_cast_fp16")];
            tensor<int32, [3]> input_1_perm_1 = const()[name = tensor<string, []>("input_1_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> input_3_axes_1 = const()[name = tensor<string, []>("input_3_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_0_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_0_norm_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9664)))];
            tensor<fp16, [32]> model_backbone_layers_0_0_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_0_norm_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9792)))];
            tensor<fp16, []> var_50_to_fp16 = const()[name = tensor<string, []>("op_50_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 16384, 32]> transpose_129 = transpose(perm = input_1_perm_1, x = var_121_cast_fp16)[name = tensor<string, []>("transpose_129")];
            tensor<fp16, [1, 16384, 32]> input_3_cast_fp16 = layer_norm(axes = input_3_axes_1, beta = model_backbone_layers_0_0_norm_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_0_norm_weight_to_fp16, x = transpose_129)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [1]> x_3_axes_1 = const()[name = tensor<string, []>("x_3_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_norm1_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9920)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_norm1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10048)))];
            tensor<fp16, [1, 16384, 32]> x_3_cast_fp16 = layer_norm(axes = x_3_axes_1, beta = model_backbone_layers_0_1_0_norm1_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_1_0_norm1_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [3]> var_154_perm_1 = const()[name = tensor<string, []>("op_154_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [4]> var_155 = const()[name = tensor<string, []>("op_155"), val = tensor<int32, [4]>([1, 32, 128, 128])];
            tensor<fp16, [1, 32, 16384]> transpose_128 = transpose(perm = var_154_perm_1, x = x_3_cast_fp16)[name = tensor<string, []>("transpose_128")];
            tensor<fp16, [1, 32, 128, 128]> x_5_cast_fp16 = reshape(shape = var_155, x = transpose_128)[name = tensor<string, []>("x_5_cast_fp16")];
            tensor<int32, [2]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [2]>([8, 8])];
            tensor<int32, [2]> var_161 = const()[name = tensor<string, []>("op_161"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_7_pad_type_1 = const()[name = tensor<string, []>("x_7_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_7_pad_1 = const()[name = tensor<string, []>("x_7_pad_1"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 8, 8]> model_backbone_layers_0_1_0_attn_sr_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_attn_sr_weight_to_fp16"), val = tensor<fp16, [32, 32, 8, 8]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10176)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_attn_sr_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_attn_sr_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141312)))];
            tensor<fp16, [1, 32, 16, 16]> x_7_cast_fp16 = conv(bias = model_backbone_layers_0_1_0_attn_sr_bias_to_fp16, dilations = var_161, groups = var_45, pad = x_7_pad_1, pad_type = x_7_pad_type_1, strides = var_159, weight = model_backbone_layers_0_1_0_attn_sr_weight_to_fp16, x = x_5_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, [3]> concat_19 = const()[name = tensor<string, []>("concat_19"), val = tensor<int32, [3]>([1, 32, 256])];
            tensor<fp16, [1, 32, 256]> var_164_cast_fp16 = reshape(shape = concat_19, x = x_7_cast_fp16)[name = tensor<string, []>("op_164_cast_fp16")];
            tensor<int32, [3]> var_165_perm_1 = const()[name = tensor<string, []>("op_165_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_kv_1_axes_1 = const()[name = tensor<string, []>("x_kv_1_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_attn_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_attn_norm_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141440)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_attn_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_attn_norm_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141568)))];
            tensor<fp16, [1, 256, 32]> transpose_127 = transpose(perm = var_165_perm_1, x = var_164_cast_fp16)[name = tensor<string, []>("transpose_127")];
            tensor<fp16, [1, 256, 32]> x_kv_1_cast_fp16 = layer_norm(axes = x_kv_1_axes_1, beta = model_backbone_layers_0_1_0_attn_norm_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_1_0_attn_norm_weight_to_fp16, x = transpose_127)[name = tensor<string, []>("x_kv_1_cast_fp16")];
            tensor<int32, [3]> query_1_perm_1 = const()[name = tensor<string, []>("query_1_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> key_1_perm_1 = const()[name = tensor<string, []>("key_1_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [32, 32]> var_195_0_to_fp16 = const()[name = tensor<string, []>("op_195_0_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141696)))];
            tensor<fp16, [32]> var_202_0_to_fp16 = const()[name = tensor<string, []>("op_202_0_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(143808)))];
            tensor<fp16, [16384, 1, 32]> transpose_126 = transpose(perm = query_1_perm_1, x = x_3_cast_fp16)[name = tensor<string, []>("transpose_126")];
            tensor<fp16, [16384, 1, 32]> linear_24_cast_fp16 = linear(bias = var_202_0_to_fp16, weight = var_195_0_to_fp16, x = transpose_126)[name = tensor<string, []>("linear_24_cast_fp16")];
            tensor<fp16, [64, 32]> var_195_1_to_fp16 = const()[name = tensor<string, []>("op_195_1_to_fp16"), val = tensor<fp16, [64, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(143936)))];
            tensor<fp16, [64]> var_202_1_to_fp16 = const()[name = tensor<string, []>("op_202_1_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(148096)))];
            tensor<fp16, [256, 1, 32]> transpose_125 = transpose(perm = key_1_perm_1, x = x_kv_1_cast_fp16)[name = tensor<string, []>("transpose_125")];
            tensor<fp16, [256, 1, 64]> linear_25_cast_fp16 = linear(bias = var_202_1_to_fp16, weight = var_195_1_to_fp16, x = transpose_125)[name = tensor<string, []>("linear_25_cast_fp16")];
            tensor<int32, [2]> var_207_split_sizes_1 = const()[name = tensor<string, []>("op_207_split_sizes_1"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_207_axis_1 = const()[name = tensor<string, []>("op_207_axis_1"), val = tensor<int32, []>(-1)];
            tensor<fp16, [256, 1, 32]> var_207_cast_fp16_0, tensor<fp16, [256, 1, 32]> var_207_cast_fp16_1 = split(axis = var_207_axis_1, split_sizes = var_207_split_sizes_1, x = linear_25_cast_fp16)[name = tensor<string, []>("op_207_cast_fp16")];
            tensor<int32, [3]> v_3_perm_1 = const()[name = tensor<string, []>("v_3_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, []> _inversed_q_scaled_1_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_q_scaled_1_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [16384, 1, 32]> _inversed_q_scaled_1_cast_fp16 = mul(x = linear_24_cast_fp16, y = _inversed_q_scaled_1_y_0_to_fp16)[name = tensor<string, []>("_inversed_q_scaled_1_cast_fp16")];
            tensor<bool, []> input_7_transpose_x_1 = const()[name = tensor<string, []>("input_7_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_7_transpose_y_1 = const()[name = tensor<string, []>("input_7_transpose_y_1"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> transpose_24_perm_0 = const()[name = tensor<string, []>("transpose_24_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> transpose_25_perm_0 = const()[name = tensor<string, []>("transpose_25_perm_0"), val = tensor<int32, [3]>([1, 2, 0])];
            tensor<fp16, [1, 32, 256]> transpose_122 = transpose(perm = transpose_25_perm_0, x = var_207_cast_fp16_0)[name = tensor<string, []>("transpose_122")];
            tensor<fp16, [1, 16384, 32]> transpose_123 = transpose(perm = transpose_24_perm_0, x = _inversed_q_scaled_1_cast_fp16)[name = tensor<string, []>("transpose_123")];
            tensor<fp16, [1, 16384, 256]> input_7_cast_fp16 = matmul(transpose_x = input_7_transpose_x_1, transpose_y = input_7_transpose_y_1, x = transpose_123, y = transpose_122)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [1, 16384, 256]> attn_output_weights_1_cast_fp16 = softmax(axis = var_49, x = input_7_cast_fp16)[name = tensor<string, []>("attn_output_weights_1_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_1 = const()[name = tensor<string, []>("attn_output_1_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_1 = const()[name = tensor<string, []>("attn_output_1_transpose_y_1"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 32]> transpose_124 = transpose(perm = v_3_perm_1, x = var_207_cast_fp16_1)[name = tensor<string, []>("transpose_124")];
            tensor<fp16, [1, 16384, 32]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_1, transpose_y = attn_output_1_transpose_y_1, x = attn_output_weights_1_cast_fp16, y = transpose_124)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [3]> var_238_perm_1 = const()[name = tensor<string, []>("op_238_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [2]> var_242 = const()[name = tensor<string, []>("op_242"), val = tensor<int32, [2]>([16384, 32])];
            tensor<fp16, [16384, 1, 32]> transpose_121 = transpose(perm = var_238_perm_1, x = attn_output_1_cast_fp16)[name = tensor<string, []>("transpose_121")];
            tensor<fp16, [16384, 32]> attn_output_3_cast_fp16 = reshape(shape = var_242, x = transpose_121)[name = tensor<string, []>("attn_output_3_cast_fp16")];
            tensor<fp16, [32, 32]> model_backbone_layers_0_1_0_attn_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_attn_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(148288)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_attn_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_attn_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(150400)))];
            tensor<fp16, [16384, 32]> linear_26_cast_fp16 = linear(bias = model_backbone_layers_0_1_0_attn_attn_out_proj_bias_to_fp16, weight = model_backbone_layers_0_1_0_attn_attn_out_proj_weight_to_fp16, x = attn_output_3_cast_fp16)[name = tensor<string, []>("linear_26_cast_fp16")];
            tensor<int32, [3]> var_246 = const()[name = tensor<string, []>("op_246"), val = tensor<int32, [3]>([16384, 1, 32])];
            tensor<fp16, [16384, 1, 32]> out_1_cast_fp16 = reshape(shape = var_246, x = linear_26_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<int32, [3]> input_9_perm_1 = const()[name = tensor<string, []>("input_9_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [1, 16384, 32]> transpose_120 = transpose(perm = input_9_perm_1, x = out_1_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [1, 16384, 32]> input_11_cast_fp16 = add(x = input_3_cast_fp16, y = transpose_120)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [1]> x_9_axes_1 = const()[name = tensor<string, []>("x_9_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_norm2_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(150528)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_norm2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(150656)))];
            tensor<fp16, [1, 16384, 32]> x_9_cast_fp16 = layer_norm(axes = x_9_axes_1, beta = model_backbone_layers_0_1_0_norm2_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_1_0_norm2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<int32, [3]> var_258_perm_1 = const()[name = tensor<string, []>("op_258_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [4]> var_259 = const()[name = tensor<string, []>("op_259"), val = tensor<int32, [4]>([1, 32, 128, 128])];
            tensor<fp16, [1, 32, 16384]> transpose_119 = transpose(perm = var_258_perm_1, x = x_9_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 32, 128, 128]> x_11_cast_fp16 = reshape(shape = var_259, x = transpose_119)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<int32, [2]> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_268 = const()[name = tensor<string, []>("op_268"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_13_pad_type_1 = const()[name = tensor<string, []>("x_13_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_13_pad_1 = const()[name = tensor<string, []>("x_13_pad_1"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 32, 1, 1]> model_backbone_layers_0_1_0_ffn_layers_0_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_ffn_layers_0_weight_to_fp16"), val = tensor<fp16, [128, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(150784)))];
            tensor<fp16, [128]> model_backbone_layers_0_1_0_ffn_layers_0_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_ffn_layers_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(159040)))];
            tensor<fp16, [1, 128, 128, 128]> x_13_cast_fp16 = conv(bias = model_backbone_layers_0_1_0_ffn_layers_0_bias_to_fp16, dilations = var_268, groups = var_45, pad = x_13_pad_1, pad_type = x_13_pad_type_1, strides = var_266, weight = model_backbone_layers_0_1_0_ffn_layers_0_weight_to_fp16, x = x_11_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [2]> var_273 = const()[name = tensor<string, []>("op_273"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_275 = const()[name = tensor<string, []>("op_275"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_1 = const()[name = tensor<string, []>("input_13_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_1 = const()[name = tensor<string, []>("input_13_pad_1"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 1, 3, 3]> model_backbone_layers_0_1_0_ffn_layers_1_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_ffn_layers_1_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(159360)))];
            tensor<fp16, [128]> model_backbone_layers_0_1_0_ffn_layers_1_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_ffn_layers_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(161728)))];
            tensor<fp16, [1, 128, 128, 128]> input_13_cast_fp16 = conv(bias = model_backbone_layers_0_1_0_ffn_layers_1_bias_to_fp16, dilations = var_275, groups = var_40, pad = input_13_pad_1, pad_type = input_13_pad_type_1, strides = var_273, weight = model_backbone_layers_0_1_0_ffn_layers_1_weight_to_fp16, x = x_13_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> input_15_mode_1 = const()[name = tensor<string, []>("input_15_mode_1"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 128, 128]> input_15_cast_fp16 = gelu(mode = input_15_mode_1, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_282 = const()[name = tensor<string, []>("op_282"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_284 = const()[name = tensor<string, []>("op_284"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_17_pad_type_1 = const()[name = tensor<string, []>("input_17_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_1 = const()[name = tensor<string, []>("input_17_pad_1"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 128, 1, 1]> model_backbone_layers_0_1_0_ffn_layers_4_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_ffn_layers_4_weight_to_fp16"), val = tensor<fp16, [32, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(162048)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_0_ffn_layers_4_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_0_ffn_layers_4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170304)))];
            tensor<fp16, [1, 32, 128, 128]> input_17_cast_fp16 = conv(bias = model_backbone_layers_0_1_0_ffn_layers_4_bias_to_fp16, dilations = var_284, groups = var_45, pad = input_17_pad_1, pad_type = input_17_pad_type_1, strides = var_282, weight = model_backbone_layers_0_1_0_ffn_layers_4_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [3]> concat_20 = const()[name = tensor<string, []>("concat_20"), val = tensor<int32, [3]>([1, 32, 16384])];
            tensor<fp16, [1, 32, 16384]> var_288_cast_fp16 = reshape(shape = concat_20, x = input_17_cast_fp16)[name = tensor<string, []>("op_288_cast_fp16")];
            tensor<int32, [3]> var_289_perm_1 = const()[name = tensor<string, []>("op_289_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 16384, 32]> transpose_118 = transpose(perm = var_289_perm_1, x = var_288_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 16384, 32]> input_19_cast_fp16 = add(x = input_11_cast_fp16, y = transpose_118)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [1]> x_19_axes_1 = const()[name = tensor<string, []>("x_19_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_norm1_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170432)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_norm1_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170560)))];
            tensor<fp16, [1, 16384, 32]> x_19_cast_fp16 = layer_norm(axes = x_19_axes_1, beta = model_backbone_layers_0_1_1_norm1_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_1_1_norm1_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, [3]> var_305_perm_1 = const()[name = tensor<string, []>("op_305_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [4]> var_306 = const()[name = tensor<string, []>("op_306"), val = tensor<int32, [4]>([1, 32, 128, 128])];
            tensor<fp16, [1, 32, 16384]> transpose_117 = transpose(perm = var_305_perm_1, x = x_19_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 32, 128, 128]> x_21_cast_fp16 = reshape(shape = var_306, x = transpose_117)[name = tensor<string, []>("x_21_cast_fp16")];
            tensor<int32, [2]> var_310 = const()[name = tensor<string, []>("op_310"), val = tensor<int32, [2]>([8, 8])];
            tensor<int32, [2]> var_312 = const()[name = tensor<string, []>("op_312"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_23_pad_type_1 = const()[name = tensor<string, []>("x_23_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_23_pad_1 = const()[name = tensor<string, []>("x_23_pad_1"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 8, 8]> model_backbone_layers_0_1_1_attn_sr_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_attn_sr_weight_to_fp16"), val = tensor<fp16, [32, 32, 8, 8]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170688)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_attn_sr_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_attn_sr_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(301824)))];
            tensor<fp16, [1, 32, 16, 16]> x_23_cast_fp16 = conv(bias = model_backbone_layers_0_1_1_attn_sr_bias_to_fp16, dilations = var_312, groups = var_45, pad = x_23_pad_1, pad_type = x_23_pad_type_1, strides = var_310, weight = model_backbone_layers_0_1_1_attn_sr_weight_to_fp16, x = x_21_cast_fp16)[name = tensor<string, []>("x_23_cast_fp16")];
            tensor<int32, [3]> concat_21 = const()[name = tensor<string, []>("concat_21"), val = tensor<int32, [3]>([1, 32, 256])];
            tensor<fp16, [1, 32, 256]> var_315_cast_fp16 = reshape(shape = concat_21, x = x_23_cast_fp16)[name = tensor<string, []>("op_315_cast_fp16")];
            tensor<int32, [3]> var_316_perm_1 = const()[name = tensor<string, []>("op_316_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> x_kv_3_axes_1 = const()[name = tensor<string, []>("x_kv_3_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_attn_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_attn_norm_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(301952)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_attn_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_attn_norm_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(302080)))];
            tensor<fp16, [1, 256, 32]> transpose_116 = transpose(perm = var_316_perm_1, x = var_315_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, 256, 32]> x_kv_3_cast_fp16 = layer_norm(axes = x_kv_3_axes_1, beta = model_backbone_layers_0_1_1_attn_norm_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_1_1_attn_norm_weight_to_fp16, x = transpose_116)[name = tensor<string, []>("x_kv_3_cast_fp16")];
            tensor<int32, [3]> query_3_perm_1 = const()[name = tensor<string, []>("query_3_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> key_3_perm_1 = const()[name = tensor<string, []>("key_3_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [32, 32]> var_346_0_to_fp16 = const()[name = tensor<string, []>("op_346_0_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(302208)))];
            tensor<fp16, [32]> var_353_0_to_fp16 = const()[name = tensor<string, []>("op_353_0_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(304320)))];
            tensor<fp16, [16384, 1, 32]> transpose_115 = transpose(perm = query_3_perm_1, x = x_19_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [16384, 1, 32]> linear_27_cast_fp16 = linear(bias = var_353_0_to_fp16, weight = var_346_0_to_fp16, x = transpose_115)[name = tensor<string, []>("linear_27_cast_fp16")];
            tensor<fp16, [64, 32]> var_346_1_to_fp16 = const()[name = tensor<string, []>("op_346_1_to_fp16"), val = tensor<fp16, [64, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(304448)))];
            tensor<fp16, [64]> var_353_1_to_fp16 = const()[name = tensor<string, []>("op_353_1_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308608)))];
            tensor<fp16, [256, 1, 32]> transpose_114 = transpose(perm = key_3_perm_1, x = x_kv_3_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [256, 1, 64]> linear_28_cast_fp16 = linear(bias = var_353_1_to_fp16, weight = var_346_1_to_fp16, x = transpose_114)[name = tensor<string, []>("linear_28_cast_fp16")];
            tensor<int32, [2]> var_358_split_sizes_1 = const()[name = tensor<string, []>("op_358_split_sizes_1"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_358_axis_1 = const()[name = tensor<string, []>("op_358_axis_1"), val = tensor<int32, []>(-1)];
            tensor<fp16, [256, 1, 32]> var_358_cast_fp16_0, tensor<fp16, [256, 1, 32]> var_358_cast_fp16_1 = split(axis = var_358_axis_1, split_sizes = var_358_split_sizes_1, x = linear_28_cast_fp16)[name = tensor<string, []>("op_358_cast_fp16")];
            tensor<int32, [3]> v_7_perm_1 = const()[name = tensor<string, []>("v_7_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, []> _inversed_q_scaled_3_y_0_to_fp16 = const()[name = tensor<string, []>("_inversed_q_scaled_3_y_0_to_fp16"), val = tensor<fp16, []>(0x1.6ap-3)];
            tensor<fp16, [16384, 1, 32]> _inversed_q_scaled_3_cast_fp16 = mul(x = linear_27_cast_fp16, y = _inversed_q_scaled_3_y_0_to_fp16)[name = tensor<string, []>("_inversed_q_scaled_3_cast_fp16")];
            tensor<bool, []> input_23_transpose_x_1 = const()[name = tensor<string, []>("input_23_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> input_23_transpose_y_1 = const()[name = tensor<string, []>("input_23_transpose_y_1"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> transpose_26_perm_0 = const()[name = tensor<string, []>("transpose_26_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [3]> transpose_27_perm_0 = const()[name = tensor<string, []>("transpose_27_perm_0"), val = tensor<int32, [3]>([1, 2, 0])];
            tensor<fp16, [1, 32, 256]> transpose_111 = transpose(perm = transpose_27_perm_0, x = var_358_cast_fp16_0)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [1, 16384, 32]> transpose_112 = transpose(perm = transpose_26_perm_0, x = _inversed_q_scaled_3_cast_fp16)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [1, 16384, 256]> input_23_cast_fp16 = matmul(transpose_x = input_23_transpose_x_1, transpose_y = input_23_transpose_y_1, x = transpose_112, y = transpose_111)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [1, 16384, 256]> attn_output_weights_5_cast_fp16 = softmax(axis = var_49, x = input_23_cast_fp16)[name = tensor<string, []>("attn_output_weights_5_cast_fp16")];
            tensor<bool, []> attn_output_7_transpose_x_1 = const()[name = tensor<string, []>("attn_output_7_transpose_x_1"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_1 = const()[name = tensor<string, []>("attn_output_7_transpose_y_1"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 32]> transpose_113 = transpose(perm = v_7_perm_1, x = var_358_cast_fp16_1)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, 16384, 32]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_1, transpose_y = attn_output_7_transpose_y_1, x = attn_output_weights_5_cast_fp16, y = transpose_113)[name = tensor<string, []>("attn_output_7_cast_fp16")];
            tensor<int32, [3]> var_389_perm_1 = const()[name = tensor<string, []>("op_389_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, [2]> var_393 = const()[name = tensor<string, []>("op_393"), val = tensor<int32, [2]>([16384, 32])];
            tensor<fp16, [16384, 1, 32]> transpose_110 = transpose(perm = var_389_perm_1, x = attn_output_7_cast_fp16)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [16384, 32]> attn_output_9_cast_fp16 = reshape(shape = var_393, x = transpose_110)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<fp16, [32, 32]> model_backbone_layers_0_1_1_attn_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_attn_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [32, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308800)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_attn_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_attn_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(310912)))];
            tensor<fp16, [16384, 32]> linear_29_cast_fp16 = linear(bias = model_backbone_layers_0_1_1_attn_attn_out_proj_bias_to_fp16, weight = model_backbone_layers_0_1_1_attn_attn_out_proj_weight_to_fp16, x = attn_output_9_cast_fp16)[name = tensor<string, []>("linear_29_cast_fp16")];
            tensor<int32, [3]> var_397 = const()[name = tensor<string, []>("op_397"), val = tensor<int32, [3]>([16384, 1, 32])];
            tensor<fp16, [16384, 1, 32]> out_7_cast_fp16 = reshape(shape = var_397, x = linear_29_cast_fp16)[name = tensor<string, []>("out_7_cast_fp16")];
            tensor<int32, [3]> input_25_perm_1 = const()[name = tensor<string, []>("input_25_perm_1"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [1, 16384, 32]> transpose_109 = transpose(perm = input_25_perm_1, x = out_7_cast_fp16)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [1, 16384, 32]> input_27_cast_fp16 = add(x = input_19_cast_fp16, y = transpose_109)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<int32, [1]> x_25_axes_1 = const()[name = tensor<string, []>("x_25_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_norm2_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(311040)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_norm2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(311168)))];
            tensor<fp16, [1, 16384, 32]> x_25_cast_fp16 = layer_norm(axes = x_25_axes_1, beta = model_backbone_layers_0_1_1_norm2_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_1_1_norm2_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("x_25_cast_fp16")];
            tensor<int32, [3]> var_409_perm_1 = const()[name = tensor<string, []>("op_409_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [4]> var_410 = const()[name = tensor<string, []>("op_410"), val = tensor<int32, [4]>([1, 32, 128, 128])];
            tensor<fp16, [1, 32, 16384]> transpose_108 = transpose(perm = var_409_perm_1, x = x_25_cast_fp16)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [1, 32, 128, 128]> x_27_cast_fp16 = reshape(shape = var_410, x = transpose_108)[name = tensor<string, []>("x_27_cast_fp16")];
            tensor<int32, [2]> var_417 = const()[name = tensor<string, []>("op_417"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_419 = const()[name = tensor<string, []>("op_419"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_29_pad_type_1 = const()[name = tensor<string, []>("x_29_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_29_pad_1 = const()[name = tensor<string, []>("x_29_pad_1"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 32, 1, 1]> model_backbone_layers_0_1_1_ffn_layers_0_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_ffn_layers_0_weight_to_fp16"), val = tensor<fp16, [128, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(311296)))];
            tensor<fp16, [128]> model_backbone_layers_0_1_1_ffn_layers_0_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_ffn_layers_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(319552)))];
            tensor<fp16, [1, 128, 128, 128]> x_29_cast_fp16 = conv(bias = model_backbone_layers_0_1_1_ffn_layers_0_bias_to_fp16, dilations = var_419, groups = var_45, pad = x_29_pad_1, pad_type = x_29_pad_type_1, strides = var_417, weight = model_backbone_layers_0_1_1_ffn_layers_0_weight_to_fp16, x = x_27_cast_fp16)[name = tensor<string, []>("x_29_cast_fp16")];
            tensor<int32, [2]> var_424 = const()[name = tensor<string, []>("op_424"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_426 = const()[name = tensor<string, []>("op_426"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_1 = const()[name = tensor<string, []>("input_29_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_1 = const()[name = tensor<string, []>("input_29_pad_1"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 1, 3, 3]> model_backbone_layers_0_1_1_ffn_layers_1_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_ffn_layers_1_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(319872)))];
            tensor<fp16, [128]> model_backbone_layers_0_1_1_ffn_layers_1_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_ffn_layers_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(322240)))];
            tensor<fp16, [1, 128, 128, 128]> input_29_cast_fp16 = conv(bias = model_backbone_layers_0_1_1_ffn_layers_1_bias_to_fp16, dilations = var_426, groups = var_40, pad = input_29_pad_1, pad_type = input_29_pad_type_1, strides = var_424, weight = model_backbone_layers_0_1_1_ffn_layers_1_weight_to_fp16, x = x_29_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_31_mode_1 = const()[name = tensor<string, []>("input_31_mode_1"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 128, 128]> input_31_cast_fp16 = gelu(mode = input_31_mode_1, x = input_29_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [2]> var_433 = const()[name = tensor<string, []>("op_433"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_435 = const()[name = tensor<string, []>("op_435"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_1 = const()[name = tensor<string, []>("input_33_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_1 = const()[name = tensor<string, []>("input_33_pad_1"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 128, 1, 1]> model_backbone_layers_0_1_1_ffn_layers_4_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_ffn_layers_4_weight_to_fp16"), val = tensor<fp16, [32, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(322560)))];
            tensor<fp16, [32]> model_backbone_layers_0_1_1_ffn_layers_4_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_1_1_ffn_layers_4_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(330816)))];
            tensor<fp16, [1, 32, 128, 128]> input_33_cast_fp16 = conv(bias = model_backbone_layers_0_1_1_ffn_layers_4_bias_to_fp16, dilations = var_435, groups = var_45, pad = input_33_pad_1, pad_type = input_33_pad_type_1, strides = var_433, weight = model_backbone_layers_0_1_1_ffn_layers_4_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [3]> concat_22 = const()[name = tensor<string, []>("concat_22"), val = tensor<int32, [3]>([1, 32, 16384])];
            tensor<fp16, [1, 32, 16384]> var_439_cast_fp16 = reshape(shape = concat_22, x = input_33_cast_fp16)[name = tensor<string, []>("op_439_cast_fp16")];
            tensor<int32, [3]> var_440_perm_1 = const()[name = tensor<string, []>("op_440_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 16384, 32]> transpose_107 = transpose(perm = var_440_perm_1, x = var_439_cast_fp16)[name = tensor<string, []>("transpose_107")];
            tensor<fp16, [1, 16384, 32]> input_35_cast_fp16 = add(x = input_27_cast_fp16, y = transpose_107)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [1]> x_35_axes_1 = const()[name = tensor<string, []>("x_35_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [32]> model_backbone_layers_0_2_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_2_weight_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(330944)))];
            tensor<fp16, [32]> model_backbone_layers_0_2_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_0_2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(331072)))];
            tensor<fp16, [1, 16384, 32]> x_35_cast_fp16 = layer_norm(axes = x_35_axes_1, beta = model_backbone_layers_0_2_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_0_2_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("x_35_cast_fp16")];
            tensor<int32, [3]> var_449_perm_1 = const()[name = tensor<string, []>("op_449_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [4]> var_450 = const()[name = tensor<string, []>("op_450"), val = tensor<int32, [4]>([1, 32, 128, 128])];
            tensor<fp16, [1, 32, 16384]> transpose_106 = transpose(perm = var_449_perm_1, x = x_35_cast_fp16)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [1, 32, 128, 128]> input_37_cast_fp16 = reshape(shape = var_450, x = transpose_106)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<int32, [2]> var_456 = const()[name = tensor<string, []>("op_456"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_458 = const()[name = tensor<string, []>("op_458"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> x_37_pad_type_1 = const()[name = tensor<string, []>("x_37_pad_type_1"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> x_37_pad_1 = const()[name = tensor<string, []>("x_37_pad_1"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 32, 3, 3]> model_backbone_layers_1_0_projection_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_1_0_projection_weight_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(331200)))];
            tensor<fp16, [64]> model_backbone_layers_1_0_projection_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_1_0_projection_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368128)))];
            tensor<fp16, [1, 64, 64, 64]> x_37_cast_fp16 = conv(bias = model_backbone_layers_1_0_projection_bias_to_fp16, dilations = var_458, groups = var_45, pad = x_37_pad_1, pad_type = x_37_pad_type_1, strides = var_456, weight = model_backbone_layers_1_0_projection_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("x_37_cast_fp16")];
            tensor<int32, [3]> concat_23 = const()[name = tensor<string, []>("concat_23"), val = tensor<int32, [3]>([1, 64, 4096])];
            tensor<fp16, [1, 64, 4096]> var_465_cast_fp16 = reshape(shape = concat_23, x = x_37_cast_fp16)[name = tensor<string, []>("op_465_cast_fp16")];
            tensor<int32, [3]> input_39_perm_1 = const()[name = tensor<string, []>("input_39_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<int32, [1]> input_41_axes_1 = const()[name = tensor<string, []>("input_41_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [64]> model_backbone_layers_1_0_norm_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_1_0_norm_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368320)))];
            tensor<fp16, [64]> model_backbone_layers_1_0_norm_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_1_0_norm_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368512)))];
            tensor<fp16, [1, 4096, 64]> transpose_105 = transpose(perm = input_39_perm_1, x = var_465_cast_fp16)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 4096, 64]> input_41_cast_fp16 = layer_norm(axes = input_41_axes_1, beta = model_backbone_layers_1_0_norm_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_1_0_norm_weight_to_fp16, x = transpose_105)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> x_39_axes_1 = const()[name = tensor<string, []>("x_39_axes_1"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [64]> model_backbone_layers_1_1_0_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_1_1_0_norm1_weight_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368704)))];
            tensor<fp16, [64]> model_backbone_layers_1_1_0_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_backbone_layers_1_1_0_norm1_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368896)))];
            tensor<fp16, [1, 4096, 64]> x_39_cast_fp16 = layer_norm(axes = x_39_axes_1, beta = model_backbone_layers_1_1_0_norm1_bias_to_fp16, epsilon = var_50_to_fp16, gamma = model_backbone_layers_1_1_0_norm1_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("x_39_cast_fp16")];
            tensor<int32, [3]> var_498_perm_1 = const()[name = tensor<string, []>("op_498_perm_1"), val = tensor<int32, [3]>([0, 2, 1])];
